test/request-response-samples/DoStuff__should_follow_element_refs_for_parameter_ordering/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:ex="http://www.example.com/" xmlns:exds="http://www.example.com/wsdl/DoStuffService"><soap:Body><ex:DoStuffRequest messageID="11111111" creationDateTime="2015-06-05T00:00:00Z" xmlns:ex="http://www.example.com/" xmlns="http://www.example.com/"><ex:DoStuffChores><DoStuffTodoList action="Update"><laundry>9988776655443322</laundry><mowLawn>ABC123</mowLawn><cleanGutters>ABC124</cleanGutters><sweepPatio favorite="1">12121212</sweepPatio><vacuumFloors>1234</vacuumFloors><dust>998877676</dust><mopFloors>654321</mopFloors><changeAirFilter>123</changeAirFilter><completionStatus>ACTIVE</completionStatus></DoStuffTodoList></ex:DoStuffChores></ex:DoStuffRequest></soap:Body></soap:Envelope>